gyy0814/JQZZ-STM32FK1/Core/Src/user.c
//
// Created by 26913 on 2023/12/14.
//
//

#include <string.h>
//#include <stdio.h>
#include "user.h"
#include "FreeRTOS.h"
#include "queue.h"
#include "cmsis_os.h"
#include "gpio.h"
#include "stm32f1xx_hal_rtc.h"
#include "stm32f1xx_hal.h"
#include <stdbool.h>
SemaphoreHandle_t xGameSemaphore;

extern QueueHandle_t GameMessageQueueHandle;
extern EventGroupHandle_t InputEventGroup[(INPUT_NUM / 24) + 1];
extern EventGroupHandle_t MusicEventGroup;
extern QueueHandle_t OutputMessageQueueHandle;

int gameFlag=0;
void GameInit(void)
{
        xGameSemaphore = xSemaphoreCreateMutex();
}
bool HC1,HC2;
/**********************
        蜡烛(HP)
**********************/
int HP = 16;
void SetHP(int hp) {

    SetOutput(蜡烛1,(1<=hp)?GPIO_PIN_SET:GPIO_PIN_RESET);
    SetOutput(蜡烛2,(2<=hp)?GPIO_PIN_SET:GPIO_PIN_RESET);
    SetOutput(蜡烛3,(3<=hp)?GPIO_PIN_SET:GPIO_PIN_RESET);
    SetOutput(蜡烛4,(4<=hp)?GPIO_PIN_SET:GPIO_PIN_RESET);
    SetOutput(蜡烛5,(5<=hp)?GPIO_PIN_SET:GPIO_PIN_RESET);
    SetOutput(蜡烛6,(6<=hp)?GPIO_PIN_SET:GPIO_PIN_RESET);
    SetOutput(蜡烛7,(7<=hp)?GPIO_PIN_SET:GPIO_PIN_RESET);
    SetOutput(蜡烛8,(8<=hp)?GPIO_PIN_SET:GPIO_PIN_RESET);
    SetOutput(蜡烛9,(9<=hp)?GPIO_PIN_SET:GPIO_PIN_RESET);
    SetOutput(蜡烛10,(10<=hp)?GPIO_PIN_SET:GPIO_PIN_RESET);
    SetOutput(蜡烛11,(11<=hp)?GPIO_PIN_SET:GPIO_PIN_RESET);
    SetOutput(蜡烛12,(12<=hp)?GPIO_PIN_SET:GPIO_PIN_RESET);
    SetOutput(蜡烛13,(13<=hp)?GPIO_PIN_SET:GPIO_PIN_RESET);
    SetOutput(蜡烛14,(14<=hp)?GPIO_PIN_SET:GPIO_PIN_RESET);
    SetOutput(蜡烛15,(15<=hp)?GPIO_PIN_SET:GPIO_PIN_RESET);
    SetOutput(蜡烛16,(16<=hp)?GPIO_PIN_SET:GPIO_PIN_RESET);

}
extern RTC_HandleTypeDef hrtc;

void Get_RTC_Counter(uint32_t *counter)
{
    RTC_TimeTypeDef sTime;
//    RTC_DateTypeDef sDate;

    HAL_RTC_GetTime(&hrtc, &sTime, RTC_FORMAT_BIN);
//    HAL_RTC_GetDate(&hrtc, &sDate, RTC_FORMAT_BIN);

    // 计算RTC计数器值（秒数）
    *counter = sTime.Seconds + sTime.Minutes * 60 + sTime.Hours * 3600;
}

void SubHP()
{
    PlayMusicA("/02.mp3",单曲停止)
    SetPin(楼梯主灯);
    SetPin(楼梯侧窗灯);
    SetPin(二楼走廊灯);
    SetPin(书房灯);
    SetPin(茶室灯);
    SetPin(儿童房灯);
    SetHP(0);
    osDelay(1000);
    ResetPin(楼梯主灯);
    ResetPin(楼梯侧窗灯);
    ResetPin(二楼走廊灯);
    ResetPin(书房灯);
    ResetPin(茶室灯);
    ResetPin(儿童房灯);
    SetHP(HP);
    osDelay(1000);
    SetPin(楼梯主灯);
    SetPin(楼梯侧窗灯);
    SetPin(二楼走廊灯);
    SetPin(书房灯);
    SetPin(茶室灯);
    SetPin(儿童房灯);
    SetHP(0);
    osDelay(1000);
    ResetPin(楼梯主灯);
    ResetPin(楼梯侧窗灯);
    ResetPin(二楼走廊灯);
    ResetPin(书房灯);
    ResetPin(茶室灯);
    ResetPin(儿童房灯);
    SetHP(HP);
    if(HP==2)
    {
        PlayMusicB("/32.mp3",单曲停止)
    }
    SetHP(--HP);
}
/**********************
        箱子
**********************/
//箱子数量
#define BOX_NUM 68
//箱子刷卡输入pin
uint8_t BoxInputPin[BOX_NUM]=
        {
                输入茶室1,
                输入茶室2,
                输入茶室3,
                输入茶室4,
                输入茶室5,
                输入茶室6,
                输入茶室7,
                输入茶室8,
                输入扫雷1,
                输入扫雷2,
                输入扫雷3,
                输入扫雷4,
                输入扫雷5,
                输入扫雷6,
                输入扫雷7,
                输入扫雷8,
                输入扫雷9,
                输入扫雷10,
                输入扫雷11,
                输入扫雷12,
                输入扫雷14,
                输入扫雷15,
                输入扫雷16,
                输入扫雷17,
                输入扫雷18,
                输入扫雷19,
                输入扫雷20,
                输入扫雷21,
                输入扫雷22,
                输入扫雷23,
                输入扫雷24,
                输入扫雷25,
                输入卧室1,
                输入卧室2,
                输入卧室3,
                输入卧室4,
                输入卧室5,
                输入卧室6,
                输入厕所1,
                输入厕所2,
                输入厕所3,
                输入厕所4,
                输入厕所5,
                输入厕所6,
                输入厕所7,
                输入厕所8,
                输入儿童房6,
                输入儿童房7,
                输入儿童房4,
                输入儿童房1,
                输入儿童房9,
                输入儿童房5,
                输入儿童房3,
                输入儿童房8,
                输入儿童房2,
                输入走廊1,
                输入走廊2,
                输入走廊3,
                输入走廊4,
                输入楼梯1,
                输入楼梯2,
                输入楼梯3,
                输入楼梯4,
                输入大厅1,
                输入大厅2,
                输入电视1,
                输入电视2,
                输入开场
        };
//箱子电锁输出pin
uint8_t BoxOutputPin[BOX_NUM]=
        {

                输出茶室1,
                输出茶室2,
                输出茶室3,
                输出茶室4,
                输出茶室5,
                输出茶室6,
                输出茶室7,
                输出茶室8,
                输出扫雷1,
                输出扫雷2,
                输出扫雷3,
                输出扫雷4,
                输出扫雷5,
                输出扫雷6,
                输出扫雷7,
                输出扫雷8,
                输出扫雷9,
                输出扫雷10,
                输出扫雷11,
                输出扫雷12,
                输出扫雷14,
                输出扫雷15,
                输出扫雷16,
                输出扫雷17,
                输出扫雷18,
                输出扫雷19,
                输出扫雷20,
                输出扫雷21,
                输出扫雷22,
                输出扫雷23,
                输出扫雷24,
                输出扫雷25,
                输出卧室1,
                输出卧室2,
                输出卧室3,
                输出卧室4,
                输出卧室5,
                输出卧室6,
                输出厕所1,
                输出厕所2,
                输出厕所3,
                输出厕所4,
                输出厕所5,
                输出厕所6,
                输出厕所7,
                输出厕所8,
                输出儿童房1,
                输出儿童房2,
                输出儿童房3,
                输出儿童房4,
                输出儿童房5,
                输出儿童房6,
                输出儿童房7,
                输出儿童房8,
                输出儿童房9,
                输出走廊1,
                输出走廊2,
                输出走廊3,
                输出走廊4,
                输出楼梯1,
                输出楼梯2,
                输出楼梯3,
                输出楼梯4,
                输出大厅1,
                输出大厅2,
                输出电视1,
                输出电视2,
                输出开场
        };
//箱子是否打开过
bool OpenState[BOX_NUM];
//箱子属性
bool BoxProperties[BOX_NUM]=
        {
                true,
                true,
                true,
                true,
                true,
                true,
                false,
                true,
                true,
                false,
                true,
                true,
                true,
                false,
                true,
                true,
                true,
                true,
                true,
                false,
                false,
                false,
                false,
                true,
                true,
                false,
                true,
                true,
                true,
                true,
                true,
                false,
                false,
                true,
                true,
                true,
                true,
                false,
                false,
                true,
                true,
                false,
                true,
                true,
                false,
                true,
                false,
                true,
                true,
                true,
                true,
                false,
                true,
                false,
                true,
                true,
                true,
                false,
                true,
                false,
                true,
                true,
                true,
                true,
                false,
                true,
                false,
                false
        };

int Lz=0;

