gyy0814/JQZZ-STM32FK1/Core/Src/user.c
int Ls=0;
void StartBoxTask(void const *argument)
{
    for(;;)
    {

//        xSemaphoreTake(xGameSemaphore, portMAX_DELAY);
//        int GF = gameFlag;
//        xSemaphoreGive(xGameSemaphore);
//
//        if((GF>0)&&(GF<30)) {
            for (int i = 0; i < BOX_NUM; i++) {
                if (WaitBit(BoxInputPin[i], pdTRUE)) {
                    OpenLock(BoxOutputPin[i])
                    if (i == 10) {
                        PlayMusicA("/24.mp3", 单曲停止)
                    } else if (i == 12) {
                        PlayMusicA("/31.mp3", 单曲停止)
                    } else if (i == 14) {
                        PlayMusicA("/29.mp3", 单曲停止)
                    } else if (i == 15) {
                        PlayMusicA("/30.mp3", 单曲停止)
                    } else if (i == 18) {
                        PlayMusicA("/27.mp3", 单曲停止)
                    } else if (i == 24) {
                        PlayMusicA("/25.mp3", 单曲停止)
                    } else if (i == 26) {
                        PlayMusicA("/28.mp3", 单曲停止)
                    } else if (i == 28) {
                        PlayMusicA("/26.mp3", 单曲停止)
                    } else {
                        if (!OpenState[i]) {
                            if (BoxProperties[i]) {
                                PlayMusicA("/07.mp3", 单曲停止)

                            } else {
                                SubHP();
                            }
                            OpenState[i] = true;
                        }
                    }
                }
            }

            if (WaitBit(听诊器1, pdTRUE)) {
                PlayMusicA("/41.mp3", 单曲停止)
            }
            if (WaitBit(听诊器2, pdTRUE)) {
                PlayMusicA("/42.mp3", 单曲停止)
            }
            if (WaitBit(听诊器3, pdTRUE)) {
                PlayMusicA("/43.mp3", 单曲停止)
            }
            if (WaitBit(听诊器4, pdTRUE)) {
                PlayMusicA("/44.mp3", 单曲停止)
            }
            if (WaitBit(听诊器5, pdTRUE)) {
                PlayMusicA("/45.mp3", 单曲停止)
            }
            if (WaitBit(听诊器6, pdTRUE)) {
                PlayMusicA("/46.mp3", 单曲停止)
            }
            if (WaitBit(听诊器7, pdTRUE)) {
                PlayMusicA("/47.mp3", 单曲停止)
            }
            if (WaitBit(听诊器8, pdTRUE)) {
                PlayMusicA("/48.mp3", 单曲停止)
            }


            if (WaitBit(猜拳失败, pdTRUE)) {
                Lz++;
                if (Lz == 5) {
                    SubHP();
                    Lz = 0;
                    //osDelay(7000);
                } else{
                    PlayMusicA("/20.mp3", 单曲停止)
                }

            }
            if (WaitBit(猜拳胜利, pdTRUE)) {
                PlayMusicA("/19.mp3", 单曲停止)
                Ls++;
            }
            if (Ls == 10) {
                PlayMusicA("/21.mp3", 单曲停止)
                Ls = 11;
            }

            EventBits_t bits = xEventGroupWaitBits(InputEventGroup[3],
                                                   TO_BIT(娃娃1) | TO_BIT(娃娃2) | TO_BIT(娃娃3) | TO_BIT(娃娃4),
                                                   pdTRUE, pdTRUE, 0);
            if ((bits & (TO_BIT(娃娃1) | TO_BIT(娃娃2) | TO_BIT(娃娃3) | TO_BIT(娃娃4)))==(TO_BIT(娃娃1) | TO_BIT(娃娃2) | TO_BIT(娃娃3) | TO_BIT(娃娃4))) {
                ResetPin(伸缩楼梯);
                PlayMusicA("/14.mp3", 单曲停止)
            }
            if (WaitBit(火柴1, pdTRUE)) {
                if ((!HC1) && (HP < 16)) {
                    HC1 = true;
                    SetHP(++HP);
                    PlayMusicA("/15.mp3", 单曲停止)
                }
            }
            if (WaitBit(火柴2, pdTRUE)) {
                if ((!HC2) && (HP < 16)) {
                    HC2 = true;
                    SetHP(++HP);
                    PlayMusicA("/15.mp3", 单曲停止)
                }
            }
            if (WaitBit(数字摆放, pdTRUE)) {
                ResetPin(保险箱);
            }

            if (WaitBit(拉绳1, pdTRUE)) {
                SetPin(卧室灯);
                ResetPin(厕所灯);
            }
            if (WaitBit(拉绳2, pdTRUE)) {
                SetPin(厕所灯);
                ResetPin(卧室灯);
            }
        }
//    }
}
int playerNum=0;
#define GameTimeReset RunTime = 0
bool GameDelay(int *pvRunTime,int waitTime)
{
    if(waitTime<*pvRunTime)
    {
        return true;
    }
    return false;
}
void StartGameFlagTask(void const *argument)
{
    GameMessage newMessage;
    for(;;)
    {
        if(xQueueReceive(GameMessageQueueHandle, &newMessage, portMAX_DELAY) == pdTRUE)
        {
            xSemaphoreTake(xGameSemaphore, portMAX_DELAY);
            gameFlag= newMessage.Data;
            xSemaphoreGive(xGameSemaphore);
        }
    }
}
void StartGameTask(void const *argument)
{
    int RunTime = 0;

    RTC_TimeTypeDef sTime;
    uint32_t start_time, current_time;

    for(;;)
    {
        xSemaphoreTake(xGameSemaphore, portMAX_DELAY);
        switch (gameFlag) {
            case 100:
            {
                if (WaitBit(开始游戏, pdTRUE)) {

                    playerNum=8;
                    gameFlag=2;
                }
                break;
            }
            case 1: {
                if (WaitBit(开始游戏, pdTRUE)) {

                    playerNum=7;
                    gameFlag++;
                }
                break;
            }
            case 2: {
                for (int i = 0; i < BOX_NUM; i++)//复位所有箱子状态
                {
                    OpenState[i] = false;
                }
                PlayMusicB("/01.mp3", 单曲停止)
                GameTimeReset;
                gameFlag=88;
                break;
            }
            case 88:
            {
                delay(72*1000)
                break;
            }
            case 89:
            {
                SetPin(电视信号);

                // 获取起始时间
                HAL_RTC_GetTime(&hrtc, &sTime, RTC_FORMAT_BIN);
                start_time = sTime.Hours * 3600 + sTime.Minutes * 60 +sTime.Seconds;

                SetHP(HP);
                GameTimeReset;
                gameFlag++;
                break;
            }
            case 90:
            {
                delay(45*1000)
                break;
            }
            case 91:
            {
                ResetPin(草灯);
                gameFlag=3;
                break;
            }
            case 3: {

                if (WaitBit(醒来正确, pdTRUE)) {
                    OpenLock(开场正确锁)
                    PlayMusicA("/04.mp3", 单曲停止)
                    SetPin(草灯);
                    ResetPin(楼梯主灯);
                    ResetPin(楼梯侧窗灯);
                    ResetPin(书房灯);
                    ResetPin(茶室灯);
                    ResetPin(儿童房灯);
                    gameFlag = 6;
                }
                if (WaitBit(醒来错误, pdTRUE)) {
                    OpenLock(开场错误锁)
                    OpenState[67]=true;
                    SetPin(草灯);
                    SetHP(--HP);
                    PlayMusicA("/03.mp3", 单曲停止)
                    osDelay(7000);
                    ResetPin(楼梯主灯);
                    ResetPin(楼梯侧窗灯);
                    ResetPin(书房灯);
                    ResetPin(茶室灯);
                    ResetPin(儿童房灯);
                    GameTimeReset;
                    gameFlag++;
                }
                break;
            }
            case 4: {
                delay(30 * 1000)
                break;
            }
            case 5: {
                OpenLock(开场正确锁)
                gameFlag++;
                break;
            }
            case 6: {
                if (NWaitBit(黑卡移开, pdFALSE)) {
                    gameFlag++;
                }
                break;
            }
            case 7: {
                if (playerNum < 8) {
                    PlayMusicA("/05.mp3", 单曲停止)
                    GameTimeReset;
                    gameFlag++;
                } else {
                    PlayMusicA("/06.mp3", 单曲停止)
                    gameFlag = 10;
                }
                break;
            }
            case 8: {
                delay(41 * 1000)
                break;
            }
            case 9: {
                OpenLock(电视下箱锁)
                gameFlag++;
                break;
            }
            case 10: {
                if (WaitBit(茶室门牌, pdTRUE)) {
                    gameFlag++;
                }
                break;
            }
            case 11: {
                PlayMusicA("/09.mp3", 单曲停止)
                ResetPin(茶室门锁);
                ResetPin(茶室灯);

                PlayMusicB("/08.mp3", 单曲循环)
                gameFlag++;
                break;
            }
            case 12: {
                if (WaitBit(厕所门牌, pdTRUE)) {
                    gameFlag++;
                }
                break;
            }
            case 13:
            {
                ResetPin(厕所门锁);
                ResetPin(厕所灯);
                gameFlag++;
                break;
            }
            case 14:
            {
                if (WaitBit(卧室门牌, pdTRUE)) {
                    gameFlag++;
                }
                break;
            }
            case 15:
            {
                PlayMusicB("/12.mp3",单曲循环)
                ResetPin(卧室门锁);

                PlayMusicA("/13.mp3",单曲停止)
                gameFlag++;
                break;
            }
            case 16:
            {
                if(WaitBit(儿童房门牌,pdTRUE))
                {
                    gameFlag++;
                }
                break;
            }
            case 17:
            {
                PlayMusicB("/16.mp3",单曲循环)
                ResetPin(儿童房门锁);
                ResetPin(儿童房灯);

                PlayMusicA("/18.mp3",单曲停止)
                gameFlag++;
                break;
            }
            case 18:
            {
                if(WaitBit(书房门牌,pdTRUE))
                {
                    gameFlag++;
                }
                break;
            }
            case 19:
            {
                PlayMusicB("/22.mp3",单曲循环)
                ResetPin(书房门锁);
                ResetPin(书房灯);
                PlayMusicA("/23.mp3",单曲停止)
                gameFlag++;
                break;
            }
            case 20:
            {
                if(WaitBit(彩球过关,pdTRUE))
                {
                    gameFlag++;
                }
                break;
            }
            case 21:
            {
                ResetPin(八罪外门);
                gameFlag++;
                break;
            }
            case 22:
            {
                if(WaitBit(八罪过关,pdTRUE))
                {
                    gameFlag=50;
                }
                break;
            }

