gyy0814/JQZZ-STM32FK1/Core/Src/user.c
            case 30:
            {
                StopMusicA;

                SetPin(草灯);
                SetPin(茶室灯);
                SetPin(厕所灯);
                SetPin(卧室灯);
                SetPin(儿童房灯);
                SetPin(书房灯);
                SetPin(草灯);
                SetPin(楼梯主灯);
                SetPin(楼梯侧窗灯);
                SetPin(二楼走廊灯);

                ResetPin(电视信号);
                SetPin(楼梯主灯红);
                SetPin(楼梯侧窗灯红);
                SetPin(红色射灯);

                SetPlayMode(&MUSIC_1,单曲停止);
                PlayMusicB("/33.mp3",单曲停止)
                GameTimeReset;
                gameFlag++;
                break;
            }
            case 31:
            {
                delay(38*1000)
                break;
            }
            case 32:
            {
                ResetPin(楼梯主灯红);
                ResetPin(楼梯侧窗灯红);
                ResetPin(红色射灯);
                gameFlag++;
                break;
            }
            case 33:
            {
                delay(79*1000)
                break;
            }
            case 34:
            {
                ResetPin(草灯);
                ResetPin(茶室灯);
                ResetPin(厕所灯);
                ResetPin(卧室灯);
                ResetPin(儿童房灯);
                ResetPin(书房灯);
                ResetPin(草灯);
                ResetPin(楼梯主灯);
                ResetPin(楼梯侧窗灯);
                ResetPin(二楼走廊灯);

                ResetPin(出口门锁);
                gameFlag=0;
                break;
            }

            case 40:
            {
                StopMusicA;

                SetPin(草灯);
                SetPin(茶室灯);
                SetPin(厕所灯);
                SetPin(卧室灯);
                SetPin(儿童房灯);
                SetPin(书房灯);
                SetPin(草灯);
                SetPin(楼梯主灯);
                SetPin(楼梯侧窗灯);
                SetPin(二楼走廊灯);

                SetPin(楼梯主灯红);
                SetPin(楼梯侧窗灯红);
                SetPin(红色射灯);
                ResetPin(电视信号);
                SetPlayMode(&MUSIC_1,单曲停止);
                PlayMusicB("/34.mp3",单曲停止)
                GameTimeReset;
                gameFlag++;
                break;
            }
            case 41:
            {
                delay(33*1000)
                break;
            }
            case 42:
            {
                ResetPin(楼梯主灯红);
                ResetPin(楼梯侧窗灯红);
                ResetPin(红色射灯);
                gameFlag++;
                break;
            }
            case 43:
            {
                delay(79*1000)
                break;
            }
            case 44:
            {
                ResetPin(草灯);
                ResetPin(茶室灯);
                ResetPin(厕所灯);
                ResetPin(卧室灯);
                ResetPin(儿童房灯);
                ResetPin(书房灯);
                ResetPin(草灯);
                ResetPin(楼梯主灯);
                ResetPin(楼梯侧窗灯);
                ResetPin(二楼走廊灯);

                ResetPin(出口门锁);
                gameFlag=0;
                break;
            }

            case 50:
            {
                StopMusicA;

                SetPin(草灯);
                SetPin(茶室灯);
                SetPin(厕所灯);
                SetPin(卧室灯);
                SetPin(儿童房灯);
                SetPin(书房灯);
                SetPin(草灯);
                SetPin(楼梯主灯);
                SetPin(楼梯侧窗灯);
                SetPin(二楼走廊灯);

                ResetPin(楼梯主灯红);
                ResetPin(楼梯侧窗灯红);
                ResetPin(电视信号);

                SetPlayMode(&MUSIC_1,单曲停止);
                PlayMusicB("/35.mp3",单曲停止)
                GameTimeReset;
                gameFlag++;
                break;
            }
            case 51:
            {
                delay(56*1000)
                break;
            }
            case 52:
            {
                SetPin(红色射灯);
                gameFlag++;
                break;
            }
            case 53:
            {
                delay(79*1000)
                break;
            }
            case 54:
            {
                ResetPin(草灯);
                ResetPin(茶室灯);
                ResetPin(厕所灯);
                ResetPin(卧室灯);
                ResetPin(儿童房灯);
                ResetPin(书房灯);
                ResetPin(草灯);
                ResetPin(楼梯主灯);
                ResetPin(楼梯侧窗灯);
                ResetPin(二楼走廊灯);

                ResetPin(出口门锁);
                gameFlag=0;
                break;
            }

            case 60:
            {
                StopMusicA;
                StopMusicB;

                SetUsbMusic(&MUSIC_1);
                SetUsbMusic(&MUSIC_2);

                SetPlayMode(&MUSIC_2,单曲停止);
                SetPlayMode(&MUSIC_1,单曲循环);

                ResetPin(书房灯);
                ResetPin(卧室灯);
                ResetPin(厕所灯);
                ResetPin(茶室灯);
                ResetPin(草灯);
                ResetPin(楼梯主灯);
                ResetPin(楼梯侧窗灯);
                ResetPin(二楼走廊灯);
                ResetPin(楼梯侧窗灯);

                SetPin(出口门锁);
                SetPin(书房门锁);
                SetPin(儿童房门锁);
                SetPin(卧室门锁);
                SetPin(厕所门锁);
                SetPin(茶室门锁);
                ResetPin(电视信号);
                SetPin(保险箱);
                SetPin(八罪外门);
                gameFlag=0;
                SetHP(16);
                break;
            }
            case 61:
            {
                SetPin(书房灯);
                SetPin(卧室灯);
                SetPin(厕所灯);
                SetPin(茶室灯);
                SetPin(草灯);
                SetPin(楼梯主灯);
                SetPin(楼梯侧窗灯);
                SetPin(儿童房灯);
                SetPin(二楼走廊灯);
                SetPin(楼梯侧窗灯);
                SetPin(伸缩楼梯);
                ResetPin(红色射灯);
                Ls=0;
                Lz=0;
                HC1=false;
                HC2=false;
                HP=16;
                SetHP(0);
                gameFlag=0;
                break;
            }
        }
        if((gameFlag>2)&&(gameFlag<30))
        {
            // 获取起始时间
            HAL_RTC_GetTime(&hrtc, &sTime, RTC_FORMAT_BIN);
            current_time  = sTime.Hours * 3600 + sTime.Minutes * 60 + sTime.Seconds;
            if ((current_time - start_time) >= ((100 * 60)+50)) // 100分钟
            {
                gameFlag=30;
            }
            if (HP==0)
            {
                gameFlag=30;
            }
        }
        if(WaitBit(出口门牌,pdTRUE))
        {
            gameFlag=40;
        }

        RunTime++;
        static int oldGameFlag = 0;
        if(gameFlag!=oldGameFlag)
        {
            uint8_t TxBuff[5] = {0xCC,0x05,0x00,gameFlag,0xFF};
            HAL_UART_Transmit(&huart1,TxBuff,5,HAL_MAX_DELAY);
            oldGameFlag = gameFlag;
        }
        xSemaphoreGive(xGameSemaphore);
        osDelay(1); //等待音频播放
    }
}
